In [5]:
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
from numpy import nan as NA
from pandas import DataFrame,Series

%matplotlib inline

#### Series：数组和字典的结合，有序，但是可以使用非数字下标索引

In [7]:
data = {'Ohio':35000,'Texas':71000,'Oregon':16000,'Utah':5000}
d = pd.Series(data)
d

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [8]:
indexs = ['California','Ohio','Oregon','Texas']
a = pd.Series(data, index = indexs)
a

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [10]:
d.name = 'population' # 给Series 起名字
d.index.name = 'state' # 给 Series 的 index 起名字
print(d)

state
Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
Name: population, dtype: int64

In [11]:
a = pd.Series([4,7,-5,3])
a.index = ['Bob','Steven','Jeff','Ryan']
a

Bob       4
Steven    7
Jeff     -5
Ryan      3
dtype: int64

In [24]:
z = pd.Series([4,5,7.2,-5.3,3.6], index = ['d','b','a','c','e'])
print(z)
x = z.reindex(['a','b','c','d','e'])
print(x)
z.reindex(['a','b','c','d','e'],fill_value=0) #指定填充值

d    4.0
b    5.0
a    7.2
c   -5.3
e    3.6
dtype: float64
a    7.2
b    5.0
c   -5.3
d    4.0
e    3.6
dtype: float64

a    7.2
b    5.0
c   -5.3
d    4.0
e    3.6
dtype: float64

In [25]:
c = pd.Series(['blue','purple','yellow'], index = [0,2,4])
c.reindex(range(6), method = 'ffill') #指定填充方式为 fill

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [34]:
data = {'state':['California','Ohio','Oregon','Texas'],
       'year':[2000,2001,2002,2004],
       'pop':[1.5,1.7,3.6,2.9]} # key:列的名字，对应数组就是这个列的值
frame = pd.DataFrame(data, 
                     columns = ['year','state','pop','debt'],
                     index = ['one','two','three','four'])
frame

       year       state  pop debt
one    2000  California  1.5  NaN
two    2001        Ohio  1.7  NaN
three  2002      Oregon  3.6  NaN
four   2004       Texas  2.9  NaN

In [61]:
frame = pd.DataFrame({
    'year':[2000,2001,2002,2004],
    'sales':[1500,3700,2400,2900]
},index = ['one','two','three','four'])
print(frame)
frame.set_index('year') #列变索引

       year  sales
one    2000   1500
two    2001   3700
three  2002   2400
four   2004   2900

      sales
year
2000   1500
2001   3700
2002   2400
2004   2900

In [37]:
print(frame.year) # 快速访问列，不管是行还是列，返回的是一个Series
print(frame['year']) # 和普通二维数组不一样

0    2000
1    2001
2    2002
3    2004
Name: year, dtype: int64
0    2000
1    2001
2    2002
3    2004
Name: year, dtype: int64

In [53]:
#iloc 用数字索引访问行和列（左闭右开）
print(frame)
print(frame.iloc[1,]) #访问第1行
print(frame.iloc[:,1]) #访问第1列
print(frame.iloc[1:3,0:2]) #第1/2行，第0/1列 切片

   year  sales
0  2000   1500
1  2001   3700
2  2002   2400
3  2004   2900
year     2001
sales    3700
Name: 1, dtype: int64
0    1500
1    3700
2    2400
3    2900
Name: sales, dtype: int64
   year  sales
1  2001   3700
2  2002   2400

In [67]:
frame['debt'] = 100
print(frame)
frame['debt'] = np.arange(4) #长度必须一致
print(frame)
frame['debt'] = pd.Series([-1.2,-1.5,-1.7,2], index = ['two','four','five','six']) #匹配不到的索引自动扔掉
print(frame)

       year  sales  debt  easten
one    2000   1500   100    True
two    2001   3700   100    True
three  2002   2400   100    True
four   2004   2900   100    True
       year  sales  debt  easten
one    2000   1500     0    True
two    2001   3700     1    True
three  2002   2400     2    True
four   2004   2900     3    True
       year  sales  debt  easten
one    2000   1500   NaN    True
two    2001   3700  -1.2    True
three  2002   2400   NaN    True
four   2004   2900  -1.5    True

In [70]:
data = {'state':['California','Ohio','Oregon','Texas'],
       'year':[2000,2001,2002,2004],
       'pop':[1.5,1.7,3.6,2.9]} # key:列的名字，对应数组就是这个列的值
frame = pd.DataFrame(data, 
                     columns = ['year','state','pop','debt'],
                     index = ['one','two','three','four'])
frame

       year       state  pop debt
one    2000  California  1.5  NaN
two    2001        Ohio  1.7  NaN
three  2002      Oregon  3.6  NaN
four   2004       Texas  2.9  NaN

In [83]:
frame['easten'] = frame.state == 'Ohio'
print(frame)
frame['big'] = frame['pop'] > 2.5
frame

       year       state  pop debt  easten    big
one    2000  California  1.5  NaN   False  False
two    2001        Ohio  1.7  NaN    True  False
three  2002      Oregon  3.6  NaN   False   True
four   2004       Texas  2.9  NaN   False   True

       year       state  pop debt  easten    big
one    2000  California  1.5  NaN   False  False
two    2001        Ohio  1.7  NaN    True  False
three  2002      Oregon  3.6  NaN   False   True
four   2004       Texas  2.9  NaN   False   True

In [86]:
frame = pd.DataFrame(np.arange(9).reshape((3,3)),
                     index = ['a','c','d'],
                     columns = ['Ohio','Texas','Califonia'])
print(frame)
frame2 = frame.reindex(['a','b','c','d']) #数量不用匹配，没有的自动填充 NaN
print(frame2)
frame3 = frame2.reindex(columns=['Texas','Utah','California']) #重新指定行/列索引顺序
print(frame3)

   Ohio  Texas  Califonia
a     0      1          2
c     3      4          5
d     6      7          8
   Ohio  Texas  Califonia
a   0.0    1.0        2.0
b   NaN    NaN        NaN
c   3.0    4.0        5.0
d   6.0    7.0        8.0
   Texas  Utah  California
a    1.0   NaN         NaN
b    NaN   NaN         NaN
c    4.0   NaN         NaN
d    7.0   NaN         NaN

In [97]:
data = pd.DataFrame(np.arange(16).reshape(4,4),
                   columns = ['a','b','c','d'],
                   index = ['California','Ohio','Oregon','Texas'])
print(data)
print(data.drop(['California','Ohio'])) #删除 California 和 Ohio 两行
print(data.drop('a',axis=1)) # 删除 a 这一列
print(data.drop(['a','c'],axis=1))

             a   b   c   d
California   0   1   2   3
Ohio         4   5   6   7
Oregon       8   9  10  11
Texas       12  13  14  15
         a   b   c   d
Oregon   8   9  10  11
Texas   12  13  14  15
             b   c   d
California   1   2   3
Ohio         5   6   7
Oregon       9  10  11
Texas       13  14  15
             b   d
California   1   3
Ohio         5   7
Oregon       9  11
Texas       13  15

In [99]:
#数据过滤
print(data)
data[data.a < 10] # a 列小于 10 的保留

             a   b   c   d
California   0   1   2   3
Ohio         4   5   6   7
Oregon       8   9  10  11
Texas       12  13  14  15

            a  b   c   d
California  0  1   2   3
Ohio        4  5   6   7
Oregon      8  9  10  11

In [101]:
data + 100

              a    b    c    d
California  100  101  102  103
Ohio        104  105  106  107
Oregon      108  109  110  111
Texas       112  113  114  115

In [104]:
#行上操作的特殊性
s3 = data['d']
data.sub(s3,axis=0) #每一列都沿着行的方向，根据 index 做减法

            a  b  c  d
California -3 -2 -1  0
Ohio       -3 -2 -1  0
Oregon     -3 -2 -1  0
Texas      -3 -2 -1  0

In [108]:
fo = pd.DataFrame(np.random.randn(4,3),
                columns = list('bde'),
                index = ['Utah','Ohio','Yexas','New Yoke'])
print(fo)

                 b         d         e
Utah      0.238076  2.133836  0.178497
Ohio     -0.625547 -0.003866 -0.236210
Yexas     0.714134 -2.056044  2.107874
New Yoke -0.856344 -0.543784  0.140189

In [109]:
def f(x):
    return pd.Series([x.min(),x.max()],index = ['min','max'])

fo.apply(f,axis=1)

               min       max
Utah      0.178497  2.133836
Ohio     -0.625547 -0.003866
Yexas    -2.056044  2.107874
New Yoke -0.856344  0.140189

In [114]:
format = lambda x : '%.2f' % x
fo.applymap(format)

              b      d      e
Utah       0.24   2.13   0.18
Ohio      -0.63  -0.00  -0.24
Yexas      0.71  -2.06   2.11
New Yoke  -0.86  -0.54   0.14

In [115]:
fo['e'].map(format)

Utah         0.18
Ohio        -0.24
Yexas        2.11
New Yoke     0.14
Name: e, dtype: object

In [118]:
#排序
frame = pd.DataFrame(np.arange(8).reshape((2,4)),
                    index = ['three','one'],
                    columns = list('dabc'))
frame.sort_index() #按行索引排序

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [119]:
frame.sort_index(axis=1,ascending=False) #按列名降序排序

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [120]:
frame = pd.DataFrame({
    'b':[4,7,-3,2],
    'a':[0,1,0,1]
})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [122]:
frame.sort_values(by='b',ascending=False) #按 b 列的值排序

   b  a
1  7  1
0  4  0
3  2  1
2 -3  0

In [126]:
frame.sort_values(by=[1],axis=1)

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [127]:
frame.sort_values(by=[2],axis=1)

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [129]:
data = pd.DataFrame([[1,6.5,3],
                    [1,7,NA],
                    [NA,NA,NA],
                    [NA,6.5,3]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  7.0  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [130]:
cleaned = data.dropna() #有NA的行被删除
cleaned

     0    1    2
0  1.0  6.5  3.0

In [132]:
data.dropna(how='all') #全部为 NaN 才被删除

     0    1    2
0  1.0  6.5  3.0
1  1.0  7.0  NaN
3  NaN  6.5  3.0

In [135]:
data.dropna(thresh=3,axis=1) #至少有 3 个值不为 NaN的列被保留，其它删除

     1
0  6.5
1  7.0
2  NaN
3  6.5

In [ ]:
#数据合并，首先复习 SQL 的 join 概念
# outer：左右 ： 左- ， -右
# inner ：左右
# left：左右 左-
# right：左右 右-
# all：左右

In [138]:
df1 = pd.DataFrame({
    'key':list('bbacaab'),
    'data':range(7)
})

df2 = pd.DataFrame({
    'key':list('abd'),
    'data':range(3)
})

print(df1)
print(df2)

  key  data
0   b     0
1   b     1
2   a     2
3   c     3
4   a     4
5   a     5
6   b     6
  key  data
0   a     0
1   b     1
2   d     2

In [140]:
#默认根据名字相同的列操作合并，等价 pd.merge(df1,df2, on = 'key')
pd.merge(df1,df2)

  key  data
0   b     1

In [146]:
df3 = pd.DataFrame({
    'lkey':list('bbacaab'),
    'data':range(7)
})

df4 = pd.DataFrame({
    'rkey':list('abd'),
    'data':range(3)
})
print(df3)
print(df4)
pd.merge(df3,df4,left_on='lkey',right_on='rkey') #分别指定用于合并的参考列

  lkey  data
0    b     0
1    b     1
2    a     2
3    c     3
4    a     4
5    a     5
6    b     6
  rkey  data
0    a     0
1    b     1
2    d     2

  lkey  data_x rkey  data_y
0    b       0    b       1
1    b       1    b       1
2    b       6    b       1
3    a       2    a       0
4    a       4    a       0
5    a       5    a       0

In [147]:
pd.merge(df1,df2,how='outer') #指定连接方式

  key  data
0   b     0
1   b     1
2   a     2
3   c     3
4   a     4
5   a     5
6   b     6
7   a     0
8   d     2

In [149]:
pd.merge(df1,df2,on='key',suffixes=('_left','_right')) #重名列可以指定合并的后缀

  key  data_left  data_right
0   b          0           1
1   b          1           1
2   b          6           1
3   a          2           0
4   a          4           0
5   a          5           0

In [150]:
left1 = pd.DataFrame([[1,2],[3,4],[5,6]],
                    index = list('ace'),
                    columns = ['Ohio','Nevada'])
right1 = pd.DataFrame([[7,8],[9,10],[11,12],[13,14]],
                    index = list('bcde'),
                    columns = ['Missouri','Alabama'])
left1.join(right1, how = 'outer') # join 默认使用索引合并

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [152]:
s1 = pd.Series([0,1], index = ['a','b'])
s2 = pd.Series([2,3,4], index = list('cde'))
s3 = pd.Series([5,6], index = ['f','g'])
pd.concat([s1,s2,s3]) #默认沿着行的方向连接

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [153]:
pd.concat([s1,s2,s3], axis = 1)

/Users/admin/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=True'.

To retain the current behavior and silence the warning, pass sort=False

  """Entry point for launching an IPython kernel.

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [ ]:
a = pd.Series([np.nan,2.5,np.nan,3.5,4.5,np.nan],
             index = list('fedcba'))
b = pd.Series(np.arange(len(a),dtype=float64),
             index = list('fedcba'))
b[-1] = np.nan
np.where(pd.isnull(a),c,a) #根据 where 筛选，如果 a 对应位置元素为 None 就选 b